espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_pcnt.h
/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** Initialization structure. */
typedef struct {
  /** Mode to operate in. */
  PCNT_Mode_TypeDef     mode;

  /** Initial counter value (refer to reference manual for max value allowed).
   * Only used for #pcntModeOvsSingle (and possibly #pcntModeDisable) modes.
   * If using #pcntModeExtSingle or #pcntModeExtQuad modes, counter
   * value is reset to HW reset value. */
  uint32_t              counter;

  /** Initial top value (refer to reference manual for max value allowed).
   * Only used for #pcntModeOvsSingle (and possibly #pcntModeDisable) modes.
   * If using #pcntModeExtSingle or #pcntModeExtQuad modes, top
   * value is reset to HW reset value. */
  uint32_t              top;

  /** Polarity of incoming edge.
   * @li #pcntModeExtSingle mode - if false, positive edges are counted,
   *   otherwise negative edges.
   * @li #pcntModeExtQuad mode - if true, counting direction is inverted. */
  bool                  negEdge;

  /** Counting direction, only applicable for #pcntModeOvsSingle and
   * #pcntModeExtSingle modes. */
  bool                  countDown;

  /** Enable filter, only available in #pcntModeOvsSingle* mode. */
  bool                  filter;

#if defined(_SILICON_LABS_32B_SERIES_2)
  /** Enable/disable PCNT counting during debug halt. Only in OVSSINGLE and OVSQUAD modes. */
  bool                  debugHalt;
#endif

#if defined(PCNT_CTRL_HYST) || defined(_SILICON_LABS_32B_SERIES_2)
  /** Set to true to enable hysteresis. When enabled, PCNT will always
   *  overflow and underflow to TOP/2. */
  bool                  hyst;
#endif

#if defined(PCNT_CTRL_S1CDIR)
  /** Set to true to enable S1 to determine the direction of counting in
   *  OVSSINGLE or EXTCLKSINGLE modes. @n
   *  When S1 is high, the count direction is given by CNTDIR, and when S1 is
   *  low, the count direction is the opposite. */
  bool                  s1CntDir;
#endif

#if defined(_PCNT_CTRL_CNTEV_SHIFT)
  /** Selects whether the regular counter responds to up-count events,
   *  down-count events, both, or none. */
  PCNT_CntEvent_TypeDef cntEvent;
#endif

#if defined(_PCNT_CTRL_AUXCNTEV_SHIFT)
  /** Selects whether the auxiliary counter responds to up-count events,
   *  down-count events, both, or none. */
  PCNT_CntEvent_TypeDef auxCntEvent;
#endif

#if defined(_PCNT_INPUT_MASK) || defined(_SILICON_LABS_32B_SERIES_2)
  /** Select PRS channel as input to S0IN in PCNTx_INPUT register. */
  PCNT_PRSSel_TypeDef   s0PRS;

  /** Select PRS channel as input to S1IN in PCNTx_INPUT register. */
  PCNT_PRSSel_TypeDef   s1PRS;
#endif
} PCNT_Init_TypeDef;

/** Default Debug. */
#if defined(_SILICON_LABS_32B_SERIES_2)
#define DEFAULT_DEBUG_HALT  true,
#else
#define DEFAULT_DEBUG_HALT
#endif

/** Default Mode. */
#define DEFAULT_MODE    pcntModeDisable,         /**< Disabled by default. */

/** Default Hysteresis. */
#if defined(PCNT_CTRL_HYST) || defined(_SILICON_LABS_32B_SERIES_2)
#define DEFAULT_HYST    false,                   /**< Hysteresis disabled. */
#else
#define DEFAULT_HYST
#endif

/** Default counter direction*/
#if defined(PCNT_CTRL_S1CDIR)
#define DEFAULT_CDIR    true,                    /**< Counter direction is given by CNTDIR. */
#else
#define DEFAULT_CDIR
#endif

/** Default count event*/
#if defined(_PCNT_CTRL_CNTEV_SHIFT)
#define DEFAULT_CNTEV    pcntCntEventUp,         /**< Regular counter counts up on upcount events. */
#else
#define DEFAULT_CNTEV
#endif

/** Default auxiliary count event. */
#if defined(_PCNT_CTRL_AUXCNTEV_SHIFT)
#define DEFAULT_AUXCNTEV    pcntCntEventNone,    /**< Auxiliary counter doesn't respond to events. */
#else
#define DEFAULT_AUXCNTEV
#endif

/** Default selected PRS channel as S0IN and S1IN. */
#if defined(_PCNT_INPUT_MASK)
#define DEFAULT_PRS_CH      pcntPRSCh0,          /**< PRS channel 0 selected as S0IN and as S1IN. */
#elif defined(_SILICON_LABS_32B_SERIES_2)
#define DEFAULT_PRS_CH      0u,
#else
#define DEFAULT_PRS_CH
#endif

/** Default configuration for PCNT initialization structure. */
#define PCNT_INIT_DEFAULT                                                       \
  {                                                                             \
    DEFAULT_MODE                          /* Default mode. */                   \
      _PCNT_CNT_RESETVALUE,               /* Default counter HW reset value. */ \
      _PCNT_TOP_RESETVALUE,               /* Default counter HW reset value. */ \
      false,                              /* Use positive edge. */              \
      false,                              /* Up-counting. */                    \
      false,                              /* Filter disabled. */                \
    DEFAULT_DEBUG_HALT                    /* Debug Halt enabled. */             \
    DEFAULT_HYST                          /* Default Hysteresis. */             \
    DEFAULT_CDIR                          /* Default CNTDIR. */                 \
    DEFAULT_CNTEV                         /* Faults CNTEV. */                   \
    DEFAULT_AUXCNTEV                      /* Default AUXCNTEV. */               \
    DEFAULT_PRS_CH                        /* PRS channel 0 selected as S0IN. */ \
      DEFAULT_PRS_CH                      /* PRS channel 0 selected as S1IN. */ \
  }

#if defined(PCNT_OVSCFG_FILTLEN_DEFAULT) || defined(_SILICON_LABS_32B_SERIES_2)
/** Filter initialization structure */
typedef struct {
  /** Used only in OVSINGLE and OVSQUAD1X-4X modes. To use this, enable filter by
   *  setting filter to true during PCNT_Init(). Filter length = (filtLen + 5) LFACLK cycles. */
  uint8_t               filtLen;

  /** When set, removes flutter from Quaddecoder inputs S0IN and S1IN.
   *  Available only in OVSQUAD1X-4X modes. */
  bool                  flutterrm;
} PCNT_Filter_TypeDef;
#endif

/** Default configuration for PCNT initialization structure. */
#if defined(PCNT_OVSCFG_FILTLEN_DEFAULT) || defined(_SILICON_LABS_32B_SERIES_2)
#define PCNT_FILTER_DEFAULT                                                          \
  {                                                                                  \
    0,                                      /* Default length is 5 LFACLK cycles. */ \
    false                                   /* No flutter removal. */                \
  }
#endif

